import { Component } from '@angular/core';
import { BaseService } from '../services/base.service';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrl: './about.component.scss',
})
export class AboutComponent {

  constructor(public baseService: BaseService) {}

  data: any = [
    {
      url: '../../assets/1_picture.png',
      description:
        'Історія Подільського зоопарку восьмого – наймолодшого в Україні, розпочинається у 2005-му році. Це була ідея тогочасного керівництва Вінницького обласного комунального підприємства ”Агроліс”, у підпорядкуванні котрого був зоологічний розплідник мисливських тварин. Їх розводили з метою подальшого розселення у мисливських господарствах краю.',
    },
    {
      url: '../../assets/g12.png',
      description:
        'За кілька років на території розплідника було збудовано зручні вольєри і заселено тваринами, котрими поділились з вінничанами звіринці: Києва, Рівного та міста Мена, що на Чернігівщині.',
      description1:
        'Новий заклад отримав і нове завдання: працювати над відтворенням видів тварин, яких поменшало у природньому довкіллі Вінниччини, зберігати і відтворювати рідкісні види , що занесені до Червоної книги.',
    },
    {
      url: '../../assets/2423.png',
      description:
        'З часом до функцій зоопарку додались ще проведення навчально-виховної та культурно-освітньої роботи серед школярів і молоді як сприяння змістовному відпочинку городян.',
      description1:
        'Вже понад 14 років Подільський зоопарк постійно розвивається вдосконалюючи свою територію, вольєри, оновлюючи та поповнюючи колекції звірів та птахів, стає все привабливішим куточком відпочинку подільського краю.',
    },
  ];

  data1: any = [
    {
      url: '../../assets/4_picture.png',
      description:
        'Подільський зоопарк має на своїй території дитячі ігрові майданчики , зелені куточки, удосконалює свою інфраструктуру, відтворює фрагменти природного середовища , у якому мешкають звірі та птахи, прикрашає територію скульптурними зображеннями.',
      description1:
        'З 2015 року зоопарк вступив до Асоціації зоопарків та акваріумів України. Це дало можливість обмінюватись з колегами інформацією, купувати тварин, чи обмінюватись цінними видами, відслідковувати родовід тварин, що сприяє покращенню їхнього здоров’я.',
    },
  ];

  data2: any = [
    {
      url: '../../assets/2427.png',
      description:
        'В Подільському зоопарку є такі тварини: зубри, верблюди, зебра, антилопи, олені благородні, олені плямисті, ведмеді бурі та гімалайські, мавпи, вовки, коні, косулі, поні, лами, муфлони, альпаки, камерунські кози, вівці, гривисті барани, угорська сіра корова, кулани, дикі свині, дикобрази, барсуки, носухи, лемури, вепри, косулі, вовки і лисиці, єноти, сурикати, мавпи мармазетки.',
      description1:
        'Подільський зоопарк багатий і на різновиди птахів, а сааме : орли, беркути, білоголові сипи, фазани, страуси, павичі, цесарки, рідкісні породи голубів, пелікани, качки мандаринки, лебеді білі та чорні.',
    },
  ];
}
