import { Component } from '@angular/core';
import { BaseService } from '../services/base.service';

@Component({
  selector: 'app-population',
  templateUrl: './population.component.html',
  styleUrl: './population.component.scss',
})
export class PopulationComponent {
  constructor(public baseService: BaseService) {}

  data: any = [
    {
      url: '../../assets/7_picture.png',
      description:
        'Альпака – копитний ссавець родини верблюдових. В дикій природі можна зустріти на території Чилі, Перу і Болівії. Випасається на високогір’ї Анд. До 2001 альпаку помилково відносили до роду лама, назва виду була Lama pacos; проте результати дослідження ДНК показали, що дикими предками альпак є вікуньї, отже, видову назву змінено на Vicugna pacos.',
      description1:
        'Вовну альпак широко використовують у легкій промисловості. З неї виробляють ковдри, светри. В залежності від породи може різнитись колір та форма хутра. Від білого, карамельного до темно-коричневого і майже чорного. Втім, після обробки фарбами палітра руна дуже розширюється. Хутро альпаки дуже м’яке, легке і в 7 разів тепліше за вовну вівці. Воно майже водонепроникне і позбавлене жиру, тому довго не брудниться, не спричиняє алергії і дуже зносостійке. ',
    },
    {
      url: '../../assets/8_picture.png',
      description:
        'Леви – одні з небагатьох наземних хижаків і єдині представники сімейства котячих, у яких самці значно відрізняються від самок: левиці виділяються меншими розмірами і відсутністю гриви.',
      description1:
        'Характерною особливістю як лева, так і левиці, є пухнастий пучок – «пензлик» на кінці хвоста, довжина якого становить близько 5 см. При народженні пензлик відсутній і починає розвиватися тільки з п’ятого місяця життя левенят. У віці семи місяців він вже добре помітний.',
    },
    {
      url: '../../assets/9_picture.png',
      description:
        'Домашні кури – це перші приручені птахи в історії людства Їх приручили і одомашнили більше 8000 років тому. Більш давньою історією спілкування з людьми можуть похвалитися лише собаки.',
      description1:
        'Предками сучасних курей були дикі чагарникові кури родом з Південно-Східної Азії. З тих пір виведено породи, які розрізняються за забарвленням, формою тіла, напрямку використання і багатьма іншими ознаками. Одна з таких – порода китайських шовковистих курей. Вона також має тисячолітню історію. Згадка про цих птахів зустрічається в записках мандрівника Марко Поло і датується 13 століттям.',
    },
    {
      url: '../../assets/10_picture.png',
      description:
        'Ведмідь бурий — вид хижих ссавців родини ведме́девих (Ursidae). Цей звір є найбільш знаним видом своєї родини, одним з найбільших наземних хижаків у світі та найбільшим хижаком фауни України.',
    },
  ];
}
